Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_abroad/freedom_of_movement_within_the_eu/free_movement_of_people_within_the_schengen_area.html.txt.tmx
Source language: en
Languages: ga

source: Free movement of people within the Schengen Area
ga: Saoirse gluaiseachta daoine laistigh de limistéar Schengen

source: The Schengen Convention is an agreement among some European states which allows for the abolition of systematic border controls between the participating countries
ga: Is comhaontú é Coinbhinsiún Schengen i measc stáit Eorpacha áirithe, a cheadaíonn rialuithe teorann córasacha idir thíortha rannpháirteacha a chur ar ceal

source: It also includes provisions on common policy on the temporary entry of people (including the Schengen Visa), the harmonisation of external border controls, and cross-border police and judicial co-operation
ga: Áirítear ann forálacha ar chomhbheartas maidir le hiontráil shealadach daoine (lena n-áirítear Víosa Schengen), comhchuibhiú na rialuithe teorann seachtracha, agus póilíní trasteorann agus comhoibriú breithiúnach

source: The name of the Convention comes from the name of the village Schengen in Luxembourg where the Agreement was signed in 1985
ga: Tagann ainm an Choinbhinsiúin ón tsráidbhaile Schengen i Lucsamburg inar síníodh an Comhaontú sa bhliain 1985

source: A total of 26 states have implemented the agreement so far
ga: Tá an comhaontú curtha i bhfeidhm ag 26 stát ag an bpointe seo

source: Border posts and checks have been removed between Schengen area states and a common Schengen visa (see below) allows tourist or visitor access to the area
ga: Tá pointí agus seiceálacha teorann bainte amach idir na stáit limistéir Schengen agus tugann víosa choiteann Schengen (féach thíos) cead rochtana nó cuairte chuig an limistéar

source: The initial 15 states that implemented the agreement are Austria, Belgium, Denmark, Finland, France, Germany, Greece, Iceland, Italy, Luxembourg, Netherlands, Norway, Portugal, Spain and Sweden
ga: Tá an comhaontú curtha i bhfeidhm cheana féin ag na 15 stát seo a leanas: an Ostair, an Bheilg, an Danmhairg, an Fhionlainn, an Fhrainc, an Ghearmáin, an Ghréig, An Íoslainn, an Iodáil, Lucsamburg, an Ísitír, an Iorua, an Phortaingéil, an Spáinn agus an tSualainn

source: The Czech Republic, Estonia, Hungary, Latvia, Lithuania, Malta, Poland, Slovakia and Slovenia implemented it on 21 December 2007 for land and sea borders and in March 2008 for air borders
ga: Dhéin Poblacht na Seice, an Eastóin, an Ungáir, an Laitvia, an Liotuáin, Málta, an Pholainn, an tSlóvaic agus an tSlóivéin an comhaontú a chur i bhfeidhm ar an 21 Nollaig 2007 do theorainneacha talún agus farraige, agus do theorainneacha aeir i Márta 2008

source: Switzerland implemented the agreement for land borders on 12 December 2008 and for air borders in March 2009
ga: Dhein an Eilvéis an comhaontú a chur i bhfeidhm ar an 12 Nollaig 2008 do theorainneacha talún agus do theorainneacha aeir i Márta 2009

source: Liechtenstein implemented the agreement fully on 19 December 2011
ga: Dhein Lichtinstein an comhaontú a chur i bhfeidhm ar an 19 Nollaig 2011

source: Bulgaria and Romania are in the process of implementing it
ga: Tá sé mar aidhm ag an mBulgáir agus ag an Rómáin í a chur i bhfeidhm

source: Ireland and the UK have applied to take part only in the police and criminal judicial co-operation measures and not the common border control and visa provisions
ga: Tá iarratas déanta ag Éirinn agus an Ríocht Aontaithe le bheith páirteach sna bearta comhoibrithe póilíneachta agus breithiúnacha amháin

source: The Schengen arrangements deal with travel between the participating states
ga: Déileálann socruithe Schengen le taisteal idir na stáit rannpháirteacha

source: They do not affect the rights of people to live and work in other countries
ga: Níl tionchar acu ar chearta daoine ó thaobh cónaithe agus oibre i dtíortha eile

source: This is covered by EU directives and regulations on free movement of people
ga: Tá sé seo clúdaithe ag treoracha agus rialacháin an AE ar saoirse aistrithe daoine

source: The Schengen countries have implemented the following arrangements:
ga: Tá na socruithe a leanas curtha i bhfeidhm ag tíortha Schengen:

source: • They have common rules about entry and short stay visas
ga: • Tá rialacha comónta acu faoi víosaí iontrála agus gearrchónaithe

source: • They have removed checks at their common borders and have checks only at the external borders; there are separate arrangements at airports for people travelling within the Schengen area
ga: • Tá seiceálacha bainte amach acu ag comhtheorainneacha agus is ag teorainneacha seachtracha amháin a tharlaíonn seiceálacha; tá socruithe ar leith ag aerfoirt do dhaoine atá ag taisteal laistigh de limistéar Schengen

source: • They have arrangements for co-ordination between the police, customs and the judiciary in the Schengen area states and for taking measures to combat terrorism and organised crime; this can include rights of hot pursuit
ga: • Tá socruithe comhordaithe i bhfeidhm idir na póilíní, lucht custaim agus na breithiúna sna stáit i limistéar Schengen, agus chun bearta a thógáil do chomhrac na sceimhlitheoireachta agus na coiriúlachta eagraithe; d'fhéadfadh cearta maidir le tóraíocht thréan a bheith san áireamh

source: The Schengen Convention allows people who are legally present in one of the participating countries to travel to any of the other participating countries without having any border checks when crossing internal frontiers
ga: Ceadaíonn Coinbhinsiún Schengen do dhaoine atá i gceann de na tíortha rannpháirteacha go dlíthiúil taisteal chuig ceann ar bith de na tíortha rannpháirteacha eile; ní dhéanfar aon seiceálacha teorann orthu nuair atá teorainneacha inmheánacha á dtrasnú acu

source: Internal frontiers are defined as the national boundaries between the countries taking part in the Schengen Convention, together with airports and seaports in the case of traffic to and from a Schengen country
ga: Déantar teorainneacha inmheánacha a shainiú mar theorainneacha náisiúnta idir thíortha atá rannpháirteach i gCoinbhinsiún Schengen, chomh maith le haerfoirt agus calafoirt i gcás tráchta go dtí tír Schengen agus ar ais as

source: Travellers may cross the internal frontiers wherever and whenever they like without having to undergo personal checks
ga: Is féidir le taistealaithe na teorainneacha inmheánacha a thrasnú in áit ar bith agus ag am ar bith - ní bheidh gá seiceálacha pearsanta a dhéanamh orthu

source: However, anyone who enters or leaves the Schengen zone is subject to the normal checks
ga: Mar sin féin, tá duine ar bith a iontrálann nó a fhágann crios Schengen faoi réir na seiceálacha mar is gnáth

source: This does not mean that you can travel without identity documents
ga: Ní chiallaíonn sé seo gur féidir leat taisteal gan doiciméid aitheantais

source: Many of the countries concerned require their own citizens as well as others to carry some form of ID
ga: Bíonn foirm aitheantais áirithe de dhíth ag tromlach na dtíortha atá i gceist maidir lena gcuid saoránaigh féin agus daoine eile

source: You may need a passport or other form of ID to establish your entitlement to travel freely
ga: D'fhéadfadh pas nó foirm aitheantais eile a bheith de dhíth ort chun do theidlíocht do shaoirse taistil a bhunú

source: If you are legally in one participating country and you travel into another you may move around for 3 months without any checks
ga: Má tá tú i dtír rannpháirteach amháin go dlíthiúil agus go dtaistealaíonn tú chuig tír eile, is féidir leat gluaiseacht thart ar feadh 3 mhí gan seiceálacha ar bith

source: After that, your right to remain in the other country is subject to the rules in respect of taking up residence in another country
ga: Ina dhiaidh sin, tá do cheart fanacht i dtír eile faoi réir na rialacha cónaitheachta i dtír eile

source: Asylum seekers in one participating country are not entitled to travel freely to another
ga: Níl saorchead ag lucht iarrtha tearmainn i dtír rannpháirteach amháin taisteal go tír eile

source: They are subject to the rules set out in the Dublin III Regulation on the country to which their application for asylum must be made
ga: Tá siad faoi réir na rialacha atá leagtha síos i Rialachán Coinbhinsiún Bhaile Átha Cliath III maidir leis an tír lena bhfuil a n-iarratas ar thearmann déanta

source: Schengen Borders Code: Regulation (EC) No 562/2006 of the European Parliament and of the Council of 15 March 2006 established a Community Code on the rules governing the movement of persons across borders
ga: Cód Teorainneacha Schengen: Bhunaigh Rialachán (CE) Uimhir 562/2006 de Pharlaimint na hEorpa agus den Chomhairle Eorpach Cód Pobail ar an 15 Márta 2006, maidir leis na rialacha a rialaíonn gluaiseacht daoine trasna teorainneacha

source: A Schengen visa is a visa issued by one of the participating countries to third country nationals
ga: Is víosa í Víosa Schengen atá eisithe ag ceann de na tíortha rannpháirteacha chuig náisiúnaigh as tríú tíortha

source: If you have a visa to travel to one Schengen country, you do not need a further visa to travel to the others
ga: Má tá víosa agat chun taisteal go tír Schengen amháin, ní gá duit víosa bhreise a bheith agat chun taisteal chuig cinn eile

source: If you have a valid residence permit in one Schengen country you can travel to the others without needing a visa (in effect, a residence permit from a Schengen country is the same as a Schengen visa)
ga: Má tá ceadúnas cónaithe bailí agat i dtír Schengen amháin, is féidir leat taisteal chuig na tíortha eile gan víosa (tá ceadúnas cónaithe ó thír Schengen cosúil le víosa Schengen go bunúsach)

source: The Schengen Information System (SIS) is a database set up to facilitate the exchange of data on people's identities and descriptions of objects that were either stolen or lost
ga: Is bunachar sonraí é Córas Faisnéise Schengen (CFS) atá bunaithe chun aistriú sonraí a éascú maidir le céannachtaí daoine agus cur síos ar rudaí atá goidte nó caillte

source: It is available to the authorities in the participating countries
ga: Tá an córas ar fáil do na húdaráis sna tíortha rannpháirteacha

source: It is accessible by them only to the extent that they take part in the Schengen arrangements
ga: Tá sé inrochtana acu amháin sa mhéid is go bhfuil siad rannpháirteach i socruithe Schengen

source: A new system SIS II has been developed and entered into operation on 9 April 2013
ga: Tá córas nua CFS-II forbartha agus cuireadh i bhfeidhm an 10 Aibreán 2013

source: Ireland has agreed to opt in to the SIS II system
ga: Roghnaigh Éire a bheith páirteach i gcóras CFS II

source: Frontex is the EU Agency for the Management of Operational Cooperation at the External Borders of the Member States
ga: Is Gníomhaireacht AE chun Comhar Oibríochtúil a Bhainistiú ag Teorainneacha Seachtracha na mBallstát í Frontex

source: It is based in Warsaw and was set up to co-ordinate the activities of member states in the field of border security
ga: Tá sí lonnaithe i Vársá agus bunaithe le gníomhaíochtaí na mballstát a chomhordú i réimse na slándála teorann

source: Responsibility for the control and surveillance of external borders lies with the member states
ga: Luíonn an fhreagracht ar na ballstáit maidir le rialú agus faireachas na dteorainneacha seachtracha

source: Frontex was established by Regulation (EC) 2007/2004
ga: Bhunaigh Rialachán (CE) 2007/2004 Frontex

source: Ireland and the UK are not involved
ga: Níl baint ag Éirinn ná an Ríocht Aontaithe leis na cúrsaí seo

source: The original Schengen Convention (agreed in 1985) was an international agreement between the countries who agreed to be bound by it
ga: Is comhaontú idirnáisiúnta a bhí sa Choinbhinsiún Schengen bunaidh (a aontaíodh in 1985) idir thíortha a d'aontaigh a bheith faoi cheangal aige

source: A further convention was agreed in 1990
ga: Aontaíodh coinbhinsiún breise in 1990

source: The Convention came into effect in 1995
ga: Tháinig an Coinbhinsiún i bhfeidhm in 1995

source: In 1998, the conventions became part of EU law when the Treaty of Amsterdam came into effect
ga: Rinneadh na coinbhinsiúin a áireamh mar chuid de dhlí an AE in 1998 nuair a tháinig Conradh Amstardam i bhfeidhm

source: Ireland is not part of the Schengen arrangements on travel and visas
ga: Níl socruithe Schengen ar thaisteal agus víosaí curtha i bhfeidhm in Éirinn

source: It is open to Ireland to take part in these arrangements if all of the Schengen members and a representative of the Irish government vote unanimously in favour within the Council of the EU
ga: Tá oscailt ann d'Éirinn a bheith páirteach sna socruithe seo, má dhéanann gach ball Schengen agus ionadaí Rialtais na hÉireann vótáil d'aonghuth i bhfabhar laistigh de Chomhairle an AE

source: This means that Irish people are subject to passport checks at the borders of other EU member states
ga: Ciallaíonn sé seo go bhfuil muintir na hÉireann faoi réir sheiceálacha pas ag teorainneacha na mballstát AE eile

source: The External Borders Fund
ga: Ciste na dTeorainneacha Seachtracha

source: The External Borders Fund aims to help with the creation of an efficient, high and uniform level of control at the external borders
ga: Tá Ciste na dTeorainneacha Seachtracha dírithe ar chúnamh a thabhairt maidir le leibhéal rialaithe a chruthú ag teorainneacha seachtracha atá éifeachtach, ar ardchaighdeán agus aonfhoirmeach

source: Ireland is not involved
ga: Níl baint ag Éirinn leis na cúrsaí seo

source: The Prüm Treaty is sometimes referred to as Schengen Plus
ga: Déantar tagairt uaireanta do Chonradh Prüm mar Schengen Plus

source: It was signed on 27 May 2005 by 7 countries - France, Germany, Spain, Austria, Belgium, the Netherlands, Luxembourg
ga: Shínigh 7 dtír é ar an 27 Bealtaine 2005 - an Fhrainc, an Ghearmáin, an Spáinn, an Ostair, an Bheilg, an Ísiltír, Lucsamburg

source: They agreed to increase their co-operation in order fight against terrorism, cross border crime and illegal migration
ga: D'aontaigh siad comhoibriú a mhéadú chun troid in aghaidh na sceimhlitheoireachta, na coiriúlachta trasteorann agus na himirce neamhdhleathaigh

source: The agreement allows for the exchange of data on finger prints and genetic information
ga: Ceadaíonn an comhaontú do mhalartú sonraí maidir le méarloirg agus faisnéis ghéiniteach

source: The agreement is open to other Schengen member states
ga: Tá oscailt sa chomhaontú do bhallstáit Schengen eile

source: This is an international agreement between the countries concerned
ga: Is comhaontú idirnáisiúnta é seo idir na tíortha atá bainteach

source: It has no connection at present with EU law
ga: Níl aon cheangal aige le dlí an AE i láthair na huaire
